# Создать калькулятор для работы с рациональными и комплексными числами,
# организовать меню, добавив в неё систему логирования.
# логирование - сохранение всех дестви пользователя с сохранением времени действия
# app.diagrams.net

# Osiptsov84@gmail.com (9956019452)
# mobail_2003@bk.ru (+66645836941)
# rezograf@gmai.com (9119990161)
# Александр Башлаев (psyfluid@gmail.com)

1. Александр:
    * создает репозиторий
    * разрабатывет меню и контроллер
2. Артем:
    * логирование
3. Алексей:
    * расчет
4. Рафаэль:
    анализ ошибок



