"""  
Задача 2. Напишите программу, которая найдёт произведение пар чисел списка. 
Парой считаем первый и последний элемент, второй и предпоследний и т.д.
 [2, 3, 4, 5, 6] => [12, 15, 16];
[2, 3, 5, 6] => [12, 15]
"""


list = [1,2,3,4,5,6,7,8,9,10,11]
mult_first_last = [] 
for i in range(0,len(list)//2+1,1):    
    mult_first_last.append(list[i]*list[-i-1])
print(f'{list} => {mult_first_last}')
