# Решение в группах задач:
# 11. Напишите программу, которая выводит случайное
# трёхзначное число и удаляет вторую цифру этого
# числа. 

# 456 -> 46
# 782 -> 72
# 918 -> 98
# 12 мин
# Общее обсуждение решения:
# 11. Напишите программу, которая выводит случайное
# трёхзначное число и удаляет вторую цифру этого
# числа.
# 456 -> 46
# 782 -> 72
# 918 -> 98
# 8 мин

# Решение в группах задач:
# 12. Напишите программу, которая будет принимать на
# вход два числа и выводить, является ли второе число
# кратным первому. Если число 2 не кратно числу 1, то
# программа выводит остаток от деления.
# 34, 5 -> не кратно, остаток 4
# 16, 4 -> кратно
# 12 мин
# Общее обсуждение решения:
# 12. Напишите программу, которая будет принимать на
# вход два числа и выводить, является ли второе число
# кратным первому. Если число 2 не кратно числу 1, то
# программа выводит остаток от деление.
# 34, 5 -> не кратно, остаток 4
# 16, 4 -> кратно*/